app/controllers/cards_controller.rb

  def index
    @cards = current_user.cards.all.page(params[:page]).per(20)
---
SELECT "cards".* FROM "cards"